// Задайте строку, содержащую латинские буквы в обоих регистрах. 
//Сформируйте строку, в которой все заглавные буквы заменены на строчные.


char[] text = new text{ sTRoKAsRaZNYMIbukvaMI };
char[] newStr = new newStr{ };
string newText(char[] text)
{
    for (int i = 0; i < text.Length; i++)
    {
        newStr = Input.ToLower(text[i]);
        
    }
}
System.Console.WriteLine(newText(newStr));


// не понимаю что программе не нравится, C:\Users\natal\OneDrive\Рабочий стол\DZ_to_25.12\task2\Program.cs(6,20): error CS1001: Требуется идентификатор. [C:\Users\natal\OneDrive\Рабочий стол\DZ_to_25.12\task2\task2.csproj
